# RebarShapeParameters Properties

---
The RebarShapeParameters type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
RebarShapeParameters Class
Autodesk.Revit.DB.Structure Namespace